# MarkerType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayMarkersAndTextSettings..::..MarkerType Property
AnalysisDisplayMarkersAndTextSettings Class See Also
---
Type of marker.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayStyleMarkerType MarkerType { get; set; }
```

Visual Basic
---
```text
Public Property MarkerType As AnalysisDisplayStyleMarkerType
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisDisplayStyleMarkerType MarkerType {
	AnalysisDisplayStyleMarkerType get ();
	void set (AnalysisDisplayStyleMarkerType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace